// src/components/Biography.jsx
import React from "react";
import "./Biography.css"; // import external CSS

export default function Biography() {
  return (
    <div className="biography-container">
      <h2 className="biography-title">Biography</h2>
      <p className="biography-text">
        <strong>श्री महाराज जी का जीवन परिचय</strong>
        <br /><br />
        ---<br /><br />
        <strong>श्री महाराज जी का जन्म 21 नवंबर 1925 को बहराइच के वसिष्ठ नगर (बशीरगंज) में हुआ था। उन्होंने अपना पूरा जीवन राम नाम के प्रचार-प्रसार में समर्पित किया। सन्यास लेने से पहले, महाराज जी ने बहराइच, सुल्तानपुर, गोंडा और अन्य राज्यों में शिक्षक और प्रिंसिपल के रूप में सेवाएं दीं। सेवा के दौरान, राम नाम की कृपा से उन्हें सहज ही सन्यास का मार्ग प्राप्त हुआ।</strong>
        <br /><br />
        <strong>अपने गुरु श्री स्वामी पथिक जी महाराज की आशीर्वाद से उन्होंने समाज को संगठित करने का निरंतर प्रयास किया और अपनी बुलंद आवाज़ से लोगों को राम नाम की ओर प्रेरित किया। भले ही वे अब हमारे बीच शारीरिक रूप से नहीं हैं, लेकिन उनकी आत्मा और प्रभाव सदैव हमारे साथ बने रहेंगे और उनकी छत्रछाया हम पर बनी रहेगी।</strong>
        <br /><br />
        <strong>श्री महाराज जी ने 23 अप्रैल की रात 9 बजे इस शरीर को त्याग दिया और साकेतगमन किया।</strong>
        <br /><br />
        ---
        <br /><br />
        गुरु कृपा ही केवलम् !
       </p>
    </div>
  );
}
